Revit 2024 API
BuiltInFailures.RegenFailures.UserCancelledError Property
 Operation is cancelled by the user.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId UserCancelledError { get; }
Visual Basic
Public Shared ReadOnly Property UserCancelledError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ UserCancelledError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RegenFailures Class
Autodesk.Revit.DB Namespace